package spider

import (
	"fmt"
	"os"
	"strings"
	"sync"

	"github.com/echosoar/news/utils"
)

// [ [[a,b], [c, d]] ]，a 或 b，且，包含 c 或 d
// [ [[a,b], [-c, -d]] ]，a 或 b，且，后面跟随 c 或 d
var filterList [][][]string = [][][]string{
	// a
	{{"爱你"}},
	// b
	{{"不"}, {"-负", "-忘", "-变", "-断", "担任"}},
	{{"奔跑"}},
	{{"百姓"}},
	{{"闭幕"}},
	{{"把"}, {"变成"}},
	{{"被查"}},
	{{"变"}, {"-迁", "-身"}},
	{{"保驾护航"}},
	{{"部署"}, {"工作"}},
	{{"标配"}},
	{{"包"}, {"-容", "-藏"}},
	{{"必然"}},
	{{"伴我"}},
	{{"百亿补贴"}},
	// c
	{{"畅谈"}},
	{{"传"}, {"-统", "-承"}},
	{{"成"}, {"-长", "-绩", "-效", "-熟"}},
	{{"春"}, {"-天", "-色", "-风"}},
	{{"出"}, {"-发", "-版"}},
	{{"沉甸甸"}},
	{{"吹牛"}},
	{{"阐明"}},
	{{"翅膀"}},
	{{"才是"}},
	{{"潮涌"}},
	{{"昌盛"}},
	{{"串起"}},
	{{"参访"}},
	{{"创造"}, {"环境"}},
	{{"创新高"}},
	{{"草木"}},
	{{"长图"}},
	{{"场面"}, {"火爆"}},
	// d
	{{"调研"}},
	{{"多"}, {"-美", "-云"}},
	{{"读懂"}},
	{{"的美"}},
	{{"当选", "任"}, {"中央", "部", "省", "厅", "市", "处", "局", "县", "校长", "书记"}},
	{{"第"}, {"集", "届"}},
	{{"大"}, {"-片", "-爱", "-佬", "-代表"}},
	{{"惦念"}},
	{{"独家"}},
	{{"蝶变"}},
	{{"带货"}},
	{{"的力量"}},
	{{"到访"}},
	{{"抵达"}, {"北京"}},
	{{"打"}, {"-卡", "-造"}},
	{{"得人心"}},
	{{"党"}, {"-风"}},
	{{"答"}, {"-案", "-卷"}},
	{{"担当"}},
	{{"敦促"}},
	// f
	{{"发"}, {"-挥", "-展", "-布", "-表", "-送旅客"}},
	{{"防晒"}},
	{{"丰"}, {"-硕", "-收"}},
	{{"符号"}},
	{{"赋能"}},
	{{"复苏"}},
	{{"繁荣"}},
	{{"奋"}, {"-斗", "-进"}},
	{{"风"}, {"-光", "-采", "-茂", "-景"}},
	{{"非凡"}},
	{{"访"}, {"-问", "-谈", "-华"}},
	{{"浮沉"}},
	{{"放眼"}},
	{{"福利"}},
	{{"沸腾"}},
	// g
	{{"关"}, {"-键", "-心"}},
	{{"关闭"}, {"品牌"}},
	{{"贡献力量"}},
	{{"刚刚"}},
	{{"格局"}},
	{{"古今"}},
	{{"观"}, {"-察", "-点"}},
	{{"给力"}},
	{{"给世界"}},
	{{"更美好"}},
	{{"攻"}, {"-坚", "-关", "-略"}},
	{{"高质量"}},
	{{"改"}, {"-写", "-善", "-进"}},
	{{"改变"}, {"生活"}},
	{{"故事"}},
	{{"功勋"}},
	{{"共"}, {"-赢", "-赴", "-赏", "-叙", "同体"}},
	{{"各地"}},
	{{"规模"}},
	{{"逛吃"}},
	{{"国潮"}},
	{{"根植"}},
	{{"感受"}},
	{{"高温"}, {"预警", "暑", "多地", "提示", "出现", "全国"}},
	{{"公"}, {"-平", "-正"}},
	// h
	{{"很潮"}},
	{{"惠民"}},
	{{"和"}, {"-人民", "-谐"}},
	{{"航拍"}},
	{{"画卷"}},
	{{"红火"}},
	{{"好帮手"}},
	{{"合力"}},
	{{"回"}, {"-升", "-来", "-春"}},
	{{"活力"}},
	{{"喝彩"}},
	{{"夯实"}},
	{{"会"}, {"-见", "-议", "-谈", "-面"}},
	{{"欢迎"}},
	{{"换"}, {"角度"}},
	{{"海报"}},
	{{"还能", "还会"}, {"吗"}},
	// j
	{{"汲取"}, {"力量"}},
	{{"坚持"}, {"党"}},
	{{"坚"}, {"-守", "-定"}},
	{{"加"}, {"-快", "-强"}},
	{{"加速"}, {"创新", "-度"}},
	{{"聚焦"}},
	{{"精"}, {"-神", "-心"}},
	{{"焦虑"}},
	{{"基层"}},
	{{"囧"}},
	{{"叫做"}},
	{{"绘就"}},
	{{"讲"}, {"-话", "-述"}},
	{{"见"}, {"-证", "-闻"}},
	{{"急了"}},
	{{"近平"}},
	{{"建议"}},
	{{"进步"}},
	{{"家国"}},
	{{"敬献"}},
	{{"就业"}},
	{{"机遇"}},
	{{"记"}, {"-在", "-录"}},
	{{"纪律审查"}},
	{{"监察调查"}},
	{{"进"}, {"-驻", "-度"}},
	{{"接"}, {"-地气", "-任"}},
	{{"绝美"}},
	{{"绝了"}},
	{{"决不能"}},
	{{"惊喜"}},
	{{"谨防"}},
	{{"举措"}},
	{{"解"}, {"-读", "-忧"}},
	{{"渐入"}},
	{{"降"}, {"-价", "-雨"}},
	{{"仅"}, {"元"}},
	{{"今"}, {"-年", "-日"}, {"高温"}},
	{{"几多"}},
	{{"交汇"}},

	// k
	{{"看"}, {"变化", "-中国"}},
	{{"科普"}},
	{{"狂赚"}},
	{{"款"}, {"上市"}},
	{{"开"}, {"-学", "-门红", "-局", "-启", "-除党籍", "-售", "-始报名", "-拓", "-窍", "-展", "-心", "-讲", "-卖", "-售"}},
	// l
	{{"log"}},
	{{"亮"}, {"-点", "-出", "-相"}},
	{{"旅行"}},
	{{"牢牢"}},
	{{"绿水青山"}},
	{{"聆听"}},
	{{"两会"}},
	{{"领会"}},
	{{"来"}, {"-了", "-访"}},
	{{"理政"}},
	{{"浪费"}},
	{{"历史"}},
	{{"立场"}},
	{{"来时"}},
	{{"力度"}},
	{{"履新"}},
	{{"尽享"}},
	{{"连续性"}},
	// m
	{{"嘛"}},
	{{"每天"}},
	{{"秘籍"}},
	{{"名字"}},
	{{"梦想"}},
	{{"迈"}, {"-进", "-向"}},
	{{"漫步"}},
	{{"美"}, {"-食", "-丽", "-好"}},
	{{"明"}, {"-天", "-确"}},
	{{"面对面"}},
	{{"民"}, {"-主", "-心", "-生"}},
	{{"魅力"}},
	{{"描绘"}},
	{{"买家秀"}},
	{{"满足"}, {"需求"}},
	{{"秒杀"}},
	// n
	{{"年"}, {"-轻的", "-轻人", "累计"}},
	{{"暖"}, {"-人心", "-心"}},
	{{"逆袭"}},
	{{"难忘"}},
	{{"凝聚"}},
	{{"努力"}},
	{{"你"}, {"-我", "-发现", "-还敢", "-支持", "-没", "-知道"}},
	{{"能不能"}},
	{{"涅槃"}},
	// p
	{{"破"}, {"-茧", "-门"}},
	{{"评论"}},
	{{"平凡"}},
	{{"谱写"}},
	{{"蓬勃"}},
	{{"飘扬"}},
	{{"跑出"}},
	{{"跑分"}},
	{{"篇"}},
	{{"铺就"}},
	{{"盘点"}},
	// q
	{{"情"}, {"-缘", "-长", "-感"}},
	{{"青"}, {"-春", "-睐"}},
	{{"诠释"}},
	{{"前程"}},
	{{"群众"}},
	{{"期待"}},
	{{"潜力"}},
	{{"气温"}},
	{{"起来"}},
	{{"圈粉"}},
	{{"求是"}},
	{{"秋色"}},
	{{"缺席"}},
	{{"千家万户"}},
	{{"全新"}, {"上市"}},
	{{"前"}, {"#d"}, {"-月"}},
	{{"奇葩"}, {"味"}},
	{{"全力"}, {"维护"}},
	// r
	{{"热"}, {"-评", "-爱", "-情", "-闹"}},
	{{"人"}, {"-才", "-气", "-从众", "-民", "-世间"}},
	{{"认识"}},
	{{"任免"}},
	{{"惹人"}},
	{{"润泽"}},
	{{"荣誉"}},
	{{"韧性"}},
	{{"如"}, {"-何", "-画"}},
	{{"让世界"}},
	// s
	{{"谁在"}},
	{{"深化"}},
	{{"什么"}, {"体验"}},
	{{"授予"}, {"称号"}},
	{{"送好礼"}},
	{{"盛会"}},
	{{"胜利"}},
	{{"塑造"}},
	{{"守护"}},
	{{"丝路"}},
	{{"时"}, {"-节", "-评", "-政"}},
	{{"视频"}},
	{{"思想"}},
	{{"生辉"}},
	{{"速览"}},
	{{"山水"}},
	{{"收藏"}},
	{{"舒适"}},
	{{"颂"}},
	{{"书写"}},
	{{"岁月"}},
	{{"双开"}},
	{{"审查调查"}},
	{{"首发"}},
	{{"售价"}},
	{{"啥"}}, // 可能误伤
	{{"赏"}, {"花", "阳光"}},
	{{"收好"}},
	{{"史低"}},
	{{"手机", "新机", "耳机", "显示器", "旗舰", "真机", "机皇"}, {"曝光", "发布", "夺冠", "来袭", "免息", "测试", "测评", "公布"}},
	{{"首销"}},
	{{"释放"}, {"信号"}},
	{{"赛", "拿"}, {"积"}, {"分"}},
	{{"盛夏"}},
	{{"生日"}},
	{{"述评"}},
	{{"市值"}},
	{{"闪耀"}},
	{{"升级"}},
	{{"说明了"}},
	// t
	{{"探"}, {"-访", "-营", "-馆"}},
	{{"提效"}},
	{{"它"}},
	{{"提"}, {"-高", "-升"}, {"水平", "能力"}},
	{{"提供"}, {"服务"}},
	{{"通道"}},
	{{"通过"}, {"验收"}},
	{{"推进"}},
	{{"他们"}},
	{{"脱贫"}},
	{{"团结"}},
	{{"图"}, {"-强", "-说", "-知", "-景", "-卷", "-画"}},
	{{"天堂"}},
	{{"视点"}},
	{{"谈建设"}},
	{{"态势"}},
	{{"体悟"}},
	{{"凸显"}},
	{{"太酷"}},
	{{"童话"}},
	{{"体验"}, {"增强", "文化"}},
	// w
	{{"完成"}},
	{{"为"}, {"人民", "党", "-啥", "-什么", "-何"}},
	{{"我"}, {"-们", "-喜欢"}},
	{{"文旅"}},
	{{"伟大"}},
	{{"微"}, {"-记录", "-纪录", "-笑", "-观"}},
	{{"沃土"}},
	{{"委员"}},
	{{"温"}, {"-馨", "-度"}},
	{{"味道"}},
	{{"万物"}},
	{{"午", "晚"}, {"-宴", "-餐"}},
	{{"网"}, {"-评", "-友"}},
	// x
	{{"兴趣"}},
	{{"喜欢"}},
	{{"新"}, {"-时代", "-场景", "-知", "-觉", "-未来"}},
	{{"新增"}, {"功能"}},
	{{"邂逅"}},
	{{"学习"}},
	{{"协商"}},
	{{"效率"}},
	{{"现代化"}},
	{{"消费"}},
	{{"信心"}},
	{{"乡愁"}},
	{{"鲜明"}},
	{{"幸福"}},
	{{"向好"}},
	{{"携手"}},
	{{"希望"}},
	{{"性"}, {"-价比"}},
	{{"虚荣"}},
	{{"小"}, {"-记者"}, {"-镇经济"}},
	{{"薪火"}},
	{{"心心"}},
	{{"相融"}},
	{{"续约"}},
	{{"相"}, {"-约", "-聚", "-连"}},
	{{"宣传"}},
	// y
	{{"样子"}},
	{{"友谊"}},
	{{"摇篮"}},
	{{"涌现"}},
	{{"愿景"}},
	{{"引领"}},
	{{"勇立"}},
	{{"硬核"}, {"广告"}},
	{{"有"}, {"-你的", "-准备", "-个", "-多牛", "-多难", "-智慧"}},
	{{"又到"}},
	{{"意"}, {"-义", "-味"}},
	{{"一起来"}},
	{{"一脉相承"}},
	{{"已不"}},
	{{"圆满"}},
	{{"原来"}},
	{{"预"}, {"-购", "-售", "-约", "-定"}},
	{{"演讲"}},
	{{"扬帆"}},
	{{"颜值"}},
	{{"用一"}, {"来"}},
	{{"元"}, {"新低"}},
	{{"仪式感"}},
	// z
	{{"造福"}},
	{{"怎样"}},
	{{"自"}, {"-立", "-强", "-己", "-信", "-主", "-由"}},
	{{"之"}, {"-路", "-光", "-美", "-旅", "-约"}},
	{{"走"}, {"-深", "-远", "-进"}},
	{{"在"}, {"-家里", "-民间", "-行动"}},
	{{"这"}, {"-个", "-件"}},
	{{"中华"}, {"的"}},
	{{"振兴"}},
	{{"知识点"}},
	{{"专访"}},
	{{"扎"}, {"-根", "-实"}},
	{{"足迹"}},
	{{"致"}, {"-辞", "-富"}},
	{{"追梦"}},
	{{"主题"}},
	{{"中"}, {"-国式", "-国特色", "-国梦", "关系", "-年"}},
	{{"尊重"}},
	{{"综述"}},
	{{"震撼"}},
	{{"这么"}},
	{{"制度"}},
	{{"赚钱"}},
	{{"祖国"}},
	{{"朝阳"}},
	{{"正"}, {"-当时", "-能量", "-确方向"}},
	{{"总书记"}},
	{{"征程"}},
	{{"嘱托"}},
	{{"治国"}},
	{{"座谈"}},
	{{"争先"}},
	{{"筑牢"}},
	{{"增"}, {"-效", "-进"}},
	{{"逐梦"}},
	{{"至此"}},
	{{"祝福"}},
	{{"最美"}},
	{{"致敬"}},
	{{"真"}, {"-好"}},
	{{"赠", "直降"}, {"元"}},
	{{"召开"}},
	{{"绽放"}},
	{{"震惊"}},
	{{"赞叹"}},
	{{"助农"}},
	{{"助力"}},
	{{"重要支撑"}},

	// TODO: multi news
	{{"——"}},
	{{"；"}},
	{{"/"}},
	// copyright risk
	{{"《"}},
}

type NewsItem struct {
	Title    string
	Link     string
	Origin   string
	Filter   []string
	Time     int64
	Distance uint64
	Keywords []string
}

type SpiderManager struct {
	list []Spider
}

var spiderManager = &SpiderManager{
	list: make([]Spider, 0),
}

type Spider = func() []NewsItem

func Get() []NewsItem {
	spiderCount := len(spiderManager.list)
	var wg sync.WaitGroup
	wg.Add(spiderCount)
	channel := make(chan *[]NewsItem, spiderCount)
	for i := 0; i < spiderCount; i++ {
		go func(ch chan *[]NewsItem, index int, wg *sync.WaitGroup) {
			list := spiderManager.list[index]()
			ch <- &list
			wg.Done()
		}(channel, i, &wg)
	}
	go func() {
		wg.Wait()
		close(channel)
	}()
	newsItems := make([]NewsItem, 0)
	for ch := range channel {
		newsItems = append(newsItems, *ch...)
	}
	spiderName := os.Getenv("SPIDER")
	if spiderName != "" {
		fmt.Println("newsItems", newsItems)
	}
	return newsItems
}

var noFilterCache = os.Getenv("FILTER_DISABLE") == "true"

func IsNeedFilter(title string, moreFilterWords []string) []string {
	if noFilterCache {
		return []string{}
	}
	for _, filterWord := range moreFilterWords {
		if strings.Contains(title, filterWord) {
			return []string{filterWord}
		}
	}
	for _, filterWordGroup := range filterList {
		isNeedFilter := true
		wordMatched := make([]string, 0)
		// filterWordGroup 是多个分组，需要全部匹配到才可以
		preWorkMatchIndex := -1
		for _, wordlist := range filterWordGroup {
			isWordMatch := false
			matchTitle := title
			if preWorkMatchIndex >= 0 {
				matchTitle = title[preWorkMatchIndex:]
			}
			for _, word := range wordlist {
				// wordlist 多个字符串，只要其中之一匹配就可以了
				index := 0
				matched := false
				if word[0] == '-' {
					matched = strings.HasPrefix(matchTitle, word[1:])
				} else if word == "#d" {
					index = preWorkMatchIndex
					if index < len(title) && utils.ByteIsNumericOrSpace(title[index]) {
						for index < len(title) && utils.ByteIsNumericOrSpace(title[index]) {
							index += 1
						}
						word = ""
						matched = true
					} else {
						matched = false
					}
				} else {
					index = strings.Index(matchTitle, word)
					matched = index >= 0
				}

				if matched {
					isWordMatch = true
					wordMatched = append(wordMatched, word)
					preWorkMatchIndex = index + len(word)
					break
				}
			}
			// 只要有一个没有匹配的，就没有匹配
			if !isWordMatch {
				isNeedFilter = false
				break
			}
		}
		if isNeedFilter {
			return wordMatched
		}
	}
	return []string{}
}

func ItemToHtml(item *NewsItem) string {
	pubTime := ""
	if item.Time > 0 {
		pubTime = " - " + utils.FormatTime(item.Time, "01/02 15:04:05")
	}
	return "<a target=\"_blank\" href=\"" + item.Link + "\">" + item.Title + "</a> [" + item.Origin + pubTime + "]"
}
